straight.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-10-07 Mon 00:02 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Getting started with straight.el</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="T. Gustafsson. Theme: Copyright (c) 2019 [[https://github.com/gongzhitaao/orgcss][gongzhitaao]]gongzhitaao." />
<link rel="stylesheet" type="text/css" href="https://kinnala.github.io/org.css" />
</head>
<body>
<div id="content">
<h1 class="title">Getting started with straight.el</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org693f83f">1. Introduction</a></li>
<li><a href="#org79cd83d">2. Find a list of packages</a></li>
<li><a href="#org4db7a3e">3. Bootstrapping the config</a></li>
<li><a href="#orgfef06ab">4. Installing packages</a></li>
<li><a href="#org7bbd184">5. Installing <code>use-package</code></a></li>
<li><a href="#orgc12404b">6. Installing <code>ivy</code></a></li>
<li><a href="#org5f871a6">7. Recipes</a></li>
<li><a href="#orgb0dd3b0">8. A peak under the hood</a></li>
</ul>
</div>
</div>

<div id="outline-container-org693f83f" class="outline-2">
<h2 id="org693f83f"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
There exists a functional package manager for Emacs called straight.el.  It
is notorious for its complexity but I find it convenient since using Emacs
on multiple machines and keeping the config in sync can be otherwise tedious.
</p>

<p>
This post describes my setup and contains hints on using straight.el. Since I'm
using Dropbox to sync my dotfiles, I have a single init file
<code>~/Dropbox/Config/emacs/.emacs</code> which is symlinked to my home directory via <code>ln
-s ~/Dropbox/Config/emacs/.emacs ~/.emacs</code>.
</p>
</div>
</div>

<div id="outline-container-org79cd83d" class="outline-2">
<h2 id="org79cd83d"><span class="section-number-2">2</span> Find a list of packages</h2>
<div class="outline-text-2" id="text-2">
<p>
We are going to create a new <code>.emacs</code> from scratch. First you need a list of
packages to install. By default, straight.el supports MELPA, ELPA and
Emacsmirror, but you can easily fetch packages from Github and GitLab.  Any
existing <code>use-package</code> macros can be reused.
</p>

<p>
Suppose we want to have the following packages:
</p>
<ul class="org-ul">
<li><code>org</code></li>
<li><code>ivy</code></li>
<li><code>counsel</code></li>
<li><code>swiper</code></li>
<li><code>anzu</code></li>
</ul>
</div>
</div>

<div id="outline-container-org4db7a3e" class="outline-2">
<h2 id="org4db7a3e"><span class="section-number-2">3</span> Bootstrapping the config</h2>
<div class="outline-text-2" id="text-3">
<p>
The first lines of the config are magic.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">defvar</span> <span style="color: #BA36A5;">bootstrap-version</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #0000FF;">let</span> <span style="color: #7388D6;">(</span><span style="color: #909183;">(</span>bootstrap-file
       <span style="color: #709870;">(</span>expand-file-name
        <span style="color: #008000;">"straight/repos/straight.el/bootstrap.el"</span>
        user-emacs-directory<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span>bootstrap-version 5<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">unless</span> <span style="color: #909183;">(</span>file-exists-p bootstrap-file<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #0000FF;">with-current-buffer</span>
        <span style="color: #709870;">(</span>url-retrieve-synchronously
         <span style="color: #008000;">"https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"</span>
         'silent 'inhibit-cookies<span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span>goto-char <span style="color: #907373;">(</span>point-max<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span>eval-print-last-sexp<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span>load bootstrap-file nil 'nomessage<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
On Emacs startup, this will download straight.el install script from Github and
run it - but only if straight.el is not already installed.
</p>
</div>
</div>

<div id="outline-container-orgfef06ab" class="outline-2">
<h2 id="orgfef06ab"><span class="section-number-2">4</span> Installing packages</h2>
<div class="outline-text-2" id="text-4">
<p>
After running Emacs, you can install packages via <code>M-x straight-use-package</code>.
This installs and enables the package only within the current session and it
will be gone after you restart Emacs. It's great for trying out new packages!
</p>

<p>
To permanently install a package, include the following line in your <code>.emacs</code>:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #707183;">(</span>straight-use-package 'org<span style="color: #707183;">)</span>
</pre>
</div>

<p>
This installs the newest version of <code>org-mode</code> directly from its repository at
<code>code.orgmode.org</code>.
</p>

<p>
<b><b>You are advised to install <code>org</code> first so that the built-in version is not
accidentally activated.</b></b>
</p>
</div>
</div>

<div id="outline-container-org7bbd184" class="outline-2">
<h2 id="org7bbd184"><span class="section-number-2">5</span> Installing <code>use-package</code></h2>
<div class="outline-text-2" id="text-5">
<p>
The macro <code>use-package</code> is popular for keeping all package configuration in one
place. Adding the following lines to <code>.emacs</code> will install and enable it.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #707183;">(</span>straight-use-package 'use-package<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #0000FF;">setq</span> straight-use-package-by-default t<span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc12404b" class="outline-2">
<h2 id="orgc12404b"><span class="section-number-2">6</span> Installing <code>ivy</code></h2>
<div class="outline-text-2" id="text-6">
<p>
Now we can write <code>use-package</code> macros to install and configure packages:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">use-package</span> <span style="color: #D0372D;">ivy</span>
  <span style="color: #006FE0;">:init</span>
  <span style="color: #7388D6;">(</span>ivy-mode 1<span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">setq</span> ivy-height 12
        ivy-fixed-height-minibuffer t
        ivy-use-virtual-buffers t<span style="color: #7388D6;">)</span>
  <span style="color: #006FE0;">:bind</span> <span style="color: #7388D6;">(</span><span style="color: #909183;">(</span><span style="color: #008000;">"C-x b"</span> . ivy-switch-buffer<span style="color: #909183;">)</span>
         <span style="color: #909183;">(</span><span style="color: #008000;">"C-c r"</span> . ivy-resume<span style="color: #909183;">)</span>
         <span style="color: #909183;">(</span><span style="color: #008000;">"C-x C-b"</span> . ivy-switch-buffer<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #0000FF;">use-package</span> <span style="color: #D0372D;">counsel</span>
  <span style="color: #006FE0;">:bind</span> <span style="color: #7388D6;">(</span><span style="color: #909183;">(</span><span style="color: #008000;">"M-x"</span> . counsel-M-x<span style="color: #909183;">)</span>
         <span style="color: #909183;">(</span><span style="color: #008000;">"C-x C-f"</span> . counsel-find-file<span style="color: #909183;">)</span>
         <span style="color: #909183;">(</span><span style="color: #008000;">"C-c g"</span> . counsel-ag<span style="color: #909183;">)</span>
         <span style="color: #909183;">(</span><span style="color: #008000;">"C-c G"</span> . counsel-git<span style="color: #909183;">)</span>
         <span style="color: #909183;">(</span><span style="color: #008000;">"M-y"</span> . counsel-yank-pop<span style="color: #909183;">)</span>
         <span style="color: #909183;">(</span><span style="color: #008000;">"C-c C-j"</span> . counsel-imenu<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #0000FF;">use-package</span> <span style="color: #D0372D;">swiper</span>
  <span style="color: #006FE0;">:bind</span> <span style="color: #7388D6;">(</span><span style="color: #008000;">"C-c s"</span> . swiper<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org5f871a6" class="outline-2">
<h2 id="org5f871a6"><span class="section-number-2">7</span> Recipes</h2>
<div class="outline-text-2" id="text-7">
<p>
You can easily define a new recipe if the package cannot be
found in any of the supported repositories:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">use-package</span> <span style="color: #D0372D;">anzu</span>
  <span style="color: #006FE0;">:straight</span> <span style="color: #7388D6;">(</span>anzu
             <span style="color: #006FE0;">:type</span> git
             <span style="color: #006FE0;">:host</span> github
             <span style="color: #006FE0;">:repo</span> <span style="color: #008000;">"syohex/emacs-anzu"</span><span style="color: #7388D6;">)</span>
  <span style="color: #006FE0;">:init</span> <span style="color: #7388D6;">(</span>global-anzu-mode +1<span style="color: #7388D6;">)</span>
  <span style="color: #006FE0;">:bind</span> <span style="color: #7388D6;">(</span><span style="color: #008000;">"C-q"</span> . anzu-query-replace-regexp<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
This installs <code>anzu</code> from <code>github.com/syohex/emacs-anzu</code>.
</p>
</div>
</div>

<div id="outline-container-orgb0dd3b0" class="outline-2">
<h2 id="orgb0dd3b0"><span class="section-number-2">8</span> A peak under the hood</h2>
<div class="outline-text-2" id="text-8">
<p>
In <code>~/.emacs.d/straight</code> you find two directories: <code>repos</code> and <code>build</code>.  The
former contains all cloned git repositories of the installed packages.  If you
list its contents you notice that there are also some additional packages - the
dependencies of the ones that we explicitly installed. I like to add these to my
config but it's not required.
</p>

<p>
The latter directory contains bytecompiled versions of the package source code
files.  This is populated automatically by straight.el but once or twice I've
had to interfere with its contents as straight.el does not yet support custom
build steps (such as running <code>make</code>) during the installation of packages. For
example, <code>zmq</code> (which is a dependency of <code>jupyter</code>) I could only install by
first adding
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #707183;">(</span>straight-use-package
 '<span style="color: #7388D6;">(</span>zmq <span style="color: #006FE0;">:type</span> git <span style="color: #006FE0;">:host</span> github <span style="color: #006FE0;">:repo</span> <span style="color: #008000;">"dzop/emacs-zmq"</span> <span style="color: #006FE0;">:no-build</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
and then launching Emacs. This clones <code>zmq</code> to
<code>~/.emacs.d/straight/repos/emacs-zmq</code> but does not build it. Then I'd go to the
package's directory, run <code>make</code> and create a symlink
<code>~/.emacs.d/straight/build/zmq</code> which points to
<code>~/.emacs.d/straight/repos/emacs-zmq</code>.  Finally, I'd remove <code>:no-build</code> and
restart Emacs.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: T. Gustafsson. Theme: Copyright (c) 2019 <a href="https://github.com/gongzhitaao/orgcss">gongzhitaao</a>.</p>
<p class="date">Created: 2019-10-07 Mon 00:02</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
